# list列表 => 有序且可變的資料結構 => 有編號(index)，元素可以重複，可混合不同類型
# 讀取元素 => A.指定位置 B.指定範圍 
# list語法 => 宣告變數名稱 = [...,...,...,...,...] => 宣告(新增)一個容器給a
a = [11,30,25,47,69,55,12,95] 
print(a)
print(a[2]) # 讀取編號(從0開始)，選取對應的值(如果找不到編號會報錯) => []內的數字為正，讀取會從右至左；[]內數字為負，讀取會從右至左
print(a[3:6]) # 讀取範圍內的編號(觀念跟range相同) => 讀取的值包含起始點但不包含結束點

# 專用方法 => .為連結符 => 語法：宣告變數名稱.呼叫內建的方法or屬性
# 排序 => A.由小到大排序：宣告變數名稱.sort() B.由大到小排序：宣告變數名稱.sort(reverse=true)
# 新增 => 宣告變數名稱.append() => 新增元素到列表最尾端
# 刪除 => 宣告變數名稱.remove() => 刪除指定元素(只會刪除一個) => 若找不到元素，系統會報錯 (一般會先排序再進行刪除)
b = [42, 7, 89, 15, 63, 28, 91, 3, 56, 74]
c = [18, 95, 2, 67, 34, 80, 11, 59, 26, 73]
d = [12, 45, 78, 12, 33, 90, 45, 21, 67, 89, 33, 10, 56, 78, 2, 91, 67, 24, 10, 55]
b.sort()
print(b)
c.sort(reverse=True)
print(c)
c.append(17)
print(c)
d.remove(33)
print(d)
d.sort()
print(d)

# dict字典 => 以key-value的方式組成元素，key不可重覆(適合存放資料)
# dict語法 => a = {...:...,...:...,...:...} => 若key相同，則後面的值會覆蓋前面的值
e = {1:'許',2:30,3:'BBB',4:'花',5:2.85,2:55,6:3.14}
print(e)
print(e[4]) #已指定的key取值
# 新增 => 宣告變數名稱.update{...:...}
e.update({7:'三帆',5:'123',10:123})
print(e)