# Function(方法.指令)
# 宣告方法的關鍵字 => def
# 宣告語法 => def 方法名稱() :
                #執行程式碼
# 呼叫 => 方法名稱
# 呼叫時方法名稱要與宣告時相同(大小寫需一致)
def a() :
    print('Welcom')

a()

# def(_): => _為參數，如果宣告時有指定參數，呼叫時就必須放入參數
# A.並未限制參數的內容(除非有限制)
# B.若未給予參數，系統會報錯

def get(b) :
    print('python')

get(1)
get('鄭')
get(123)
get('123')
get(3.14)

def up(c) :
    print(c[0]) #print(參數[0]) => 取字首or列表第一個值 => 呼叫時若參數是整數，系統會報錯

def down(d) :
    print(d[6]) #print(參數[_]) => 取字串or列表第_個值(從0開始)

up("function")
up([90, 45, 21, 67, 89, 33])
down("function")
down([33, 90, 45, 21, 67, 89, 33, 10, 56, 78, 2])

def right(e) :
    print(e.split('.')) #split("_") => 將字串以"_"做切割(可以用.、，、:、;) => 切割後會產生新的列表
                        #split() => 字串專用方法，預設會以空格(包含換行\n跟定位點\t)作為分割符號

right("192.168.20.10")

def bb(f) :
    print(f.replace(f[4:8],"***")) #語法：參數名稱.replace(參數名稱[_:_],"替換文字") => 將字串範圍中的文字替換成其他文字

bb("000011121458")

def cc(g,h) :
    return g+h 

cc(20,30) # => return是將結果賦予給方法，如果直接執行則不會顯示出任何結果
print(cc(20,30)) # => 需要搭配print才會將結果顯現出來
i = cc(20,33) # => 一般建議給return方法賦予一個變數(也利於後續程式碼運用)，而不建議直接print
print(i)